[
   {
      "filename": "The Dumb Man",
      "questions": "[{'question': 'Please highlight in the paragraph: What does the narrator long to do with his story?', 'answer': 'If I could say the words I would sing the story. I would whisper it into the ears of women, of mothers. I would run through the streets saying it over and over.', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: How many men are initially in the room at the start of the story?', 'answer': 'The story concerns three men in a house in a street.', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: What physical feature is distinctive about the second man?', 'answer': 'There is a second man who has a long white beard.', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: What adjective is used repeatedly to describe the fourth man?', 'answer': 'I remember that a fourth man came to the house, a white silent man. Everything was as silent as the sea at night. His feet on the stone floor of the room where the three men were made no sound.', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: How does the woman feel as she waits upstairs?', 'answer': 'The woman upstairs craved love. That must have been the story. She hungered for love with her whole being.', 'type': 'inferential'}, {'question': 'Please highlight in the paragraph: What happens to the old grey man after the fourth man arrives?', 'answer': 'The grey one tried to follow him about but presently grew tired and lay down on the floor to sleep. He never awoke again.', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: What does the narrator speculate the white silent one might represent?', 'answer': 'The white silent one may have been Death.', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: What does the narrator believe understanding the dandified man would allow him to do?', 'answer': 'If I could understand him I could understand everything. I could run through the world telling a wonderful story. I would no longer be dumb.', 'type': 'inferential'}, {'question': 'Please highlight in the paragraph: What is the narrator’s primary frustration?', 'answer': 'Why was I not given words? Why am I dumb?', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: What prevents the narrator from effectively telling his story?', 'answer': 'I have a wonderful story to tell, but know no way to tell it.', 'type': 'literal'}]",
      "category": "HL"
   },
   {
      "filename": "Doctor Goldsmith",
      "questions": "[{'question': 'Please highlight in the paragraph: What was Oliver Goldsmith\\'s profession?', 'answer': 'He was sometimes called Doctor Goldsmith; for he had studied to be a physician.', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: Why was the poor woman\\'s husband unable to eat?', 'answer': 'He was not sick, but in distress; and, as for eating, there was no food in the house.', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: What did Goldsmith tell the woman to do after giving her the box?', 'answer': '\"Don\\'t open the box until you reach home.\"', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: What did Goldsmith say would be found inside the box?', 'answer': '\"You will find them inside of the box,\" he answered.', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: What did the couple find inside the box?', 'answer': 'It was full of pieces of money.', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: What were the directions on how to use the contents of the box?', 'answer': '\"TO BE TAKEN AS OFTEN AS NECESSITY REQUIRES.\"', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: Why was Goldsmith always poor himself?', 'answer': 'He gave away so much to the poor that he was always poor himself.', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: Was the husband actually sick?', 'answer': 'He was not sick, but in distress; and, as for eating, there was no food in the house.', 'type': 'literal'}, {'question': 'Please highlight in the paragraph: What did Goldsmith mean by \"medicine\"?', 'answer': 'It was full of pieces of money.', 'type': 'inferential'}, {'question': 'Please highlight in the paragraph: What does this story tell us about Goldsmith’s character?', 'answer': 'He had a gentle heart. He was always ready to help others and to share with them anything that he had.', 'type': 'inferential'}]",
      "category": "HL"
   },
   {
      "filename": "Doctor Goldsmith",
      "questions": "[{\"question\": \"Please highlight in the paragraph: What was Oliver Goldsmith's profession?\", \"answer\": \"He was sometimes called Doctor Goldsmith; for he had studied to be a physician.\", \"type\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: Why was the poor woman's husband unable to eat?\", \"answer\": \"He found that the family was in great need. The man had not had work for a long time. He was not sick, but in distress; and, as for eating, there was no food in the house.\", \"type\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What did Doctor Goldsmith tell the woman to do after giving her the medicine?\", \"answer\": \"\\\"Don't open the box until you reach home.\\\"\", \"type\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What did the woman find inside the box?\", \"answer\": \"It was full of pieces of money.\", \"type\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What were the directions for taking the medicine?\", \"answer\": \"\\\"TO BE TAKEN AS OFTEN AS NECESSITY REQUIRES.\\\"\", \"type\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: Why was Goldsmith always poor himself?\", \"answer\": \"He gave away so much to the poor that he was always poor himself.\", \"type\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What kind of books did Oliver Goldsmith write?\", \"answer\": \"He wrote many delightful books, some of which you will read when you are older.\", \"type\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: Did Doctor Goldsmith believe the husband was truly ill?\", \"answer\": \"He found that the family was in great need. The man had not had work for a long time. He was not sick, but in distress; and, as for eating, there was no food in the house.\", \"type\": \"inferential\"}, {\"question\": \"Please highlight in the paragraph: Why did Doctor Goldsmith give the woman all the money he had?\", \"answer\": \"The text does not explicitly state Doctor Goldsmith's reasoning for giving the woman all of his money.\", \"type\": \"inferential\"}, {\"question\": \"Please highlight in the paragraph: What does the phrase \\\"a gentle heart\\\" suggest about Doctor Goldsmith?\", \"answer\": \"The text does not explicitly analyze the phrase \\\"a gentle heart.\\\"\", \"type\": \"inferential\"}]",
      "category": "HL"
   }
]