[
   {
      "filename": "The Solar System",
      "questions": "[{'question': 'Please highlight in the paragraph: What lies between the orbits of Mars and Jupiter?'}, {'question': 'Please highlight in the paragraph: How many planets are there in the solar system?'}, {'question': 'Please highlight in the paragraph: What causes day and night on Earth?'}, {'question': 'Please highlight in the paragraph: What is at the centre of the solar system?'}, {'question': 'Please highlight in the paragraph: What is the name of the galaxy that our solar system is in?'}, {'question': 'Please highlight in the paragraph: Why is the Earth considered unique in our solar system?'}, {'question': 'Please highlight in the paragraph: What are the four planets in the inner solar system?'}, {'question': 'Please highlight in the paragraph: What causes the change of seasons on Earth?'}, {'question': 'Please highlight in the paragraph: What is Pluto considered to be?'}, {'question': 'Please highlight in the paragraph: Approximately how many solar systems are there in the universe?'}] \n"
   },
   {
      "filename": "The Dumb Man",
      "questions": "```json\n[\n{'question': 'Please highlight in the paragraph: What is the main character\\'s primary struggle?'},\n{'question': 'Please highlight in the paragraph: How does the setting of the house contribute to the overall mood of the story?'},\n{'question': 'Please highlight in the paragraph: What literary device is used to describe the wicked man\\'s movements?'},\n{'question': 'Please highlight in the paragraph: What can be inferred about the woman\\'s emotional state?'},\n{'question': 'Please highlight in the paragraph: What is the significance of the white silent man\\'s silence?'},\n{'question': 'Please highlight in the paragraph: How does the author use sensory details to create a vivid reading experience?'},\n{'question': 'Please highlight in the paragraph: What is the symbolic implication of the old grey man never waking up again?'},\n{'question': 'Please highlight in the paragraph: Why is the dandified man\\'s laughter a source of fascination for the narrator?'},\n{'question': 'Please highlight in the paragraph: What is the narrator\\'s proposed solution to overcome his inability to tell the story?'},\n{'question': 'Please highlight in the paragraph: What is the overall theme explored in this story?'}\n]\n```"
   },
   {
      "filename": "The Solar System",
      "questions": "[{'question': 'Please highlight in the paragraph: What lies between the orbits of Mars and Jupiter?'}, {'question': 'Please highlight in the paragraph: How many planets are there in our solar system?'}, {'question': 'Please highlight in the paragraph: What causes day and night on Earth?'}, {'question': 'Please highlight in the paragraph: Why is the Milky Way Galaxy named so?'}, {'question': 'Please highlight in the paragraph: What are the constituent elements of the inner solar system?'}, {'question': 'Please highlight in the paragraph: What is the current, estimated number of solar systems present in the universe?'}, {'question': 'Please highlight in the paragraph: Why is Pluto not considered a planet?'}, {'question': 'Please highlight in the paragraph: What, according to scientists, is unique about Earth?'}, {'question': 'Please highlight in the paragraph: What causes seasons to change on Earth?'}, {'question': 'Please highlight in the paragraph: Apart from planets and satellites what other celestial bodies are found in our solar system?'}]\n"
   },
   {
      "filename": "The Solar System",
      "questions": "[{'question': 'Please highlight in the paragraph: What lies between the orbits of Mars and Jupiter?'}, {'question': 'Please highlight in the paragraph:  What causes days and nights on Earth?'}, {'question': 'Please highlight in the paragraph:  What is Pluto considered to be?'}, {'question': 'Please highlight in the paragraph:  Which planets make up the inner solar system?'}, {'question': 'Please highlight in the paragraph:  What causes the change of seasons?'}, {'question': 'Please highlight in the paragraph: What is the name of our galaxy?'}, {'question': 'Please highlight in the paragraph: What is at the center of our solar system?'}, {'question': 'Please highlight in the paragraph:  How many solar systems are estimated to be in our universe?'}, {'question': 'Please highlight in the paragraph:  What is the only planetary body where life is known to exist?'}, {'question': 'Please highlight in the paragraph:  Which planets are in the outer solar system?'}]\n"
   },
   {
      "filename": "The Dumb Man",
      "questions": "```json\n[\n{'question': 'Please highlight in the paragraph: What is the main emotion the narrator expresses about being unable to tell the story?'},\n{'question': 'Please highlight in the paragraph: What physical action does the narrator imagine himself doing if he could tell the story?'},\n{'question': 'Please highlight in the paragraph: What are the three men in the room waiting for?'},\n{'question': 'Please highlight in the paragraph: How does the narrator describe the sound of the fourth man's entrance?'},\n{'question': 'Please highlight in the paragraph: What effect does the fourth man's presence have on the man with wicked eyes?'},\n{'question': 'Please highlight in the paragraph: What is the woman upstairs doing while waiting?'},\n{'question': 'Please highlight in the paragraph: How does the narrator describe the woman\\'s reaction to the fourth man?'},\n{'question': 'Please highlight in the paragraph: What happens to the old grey man after the fourth man arrives?'},\n{'question': 'Please highlight in the paragraph: Who does the narrator believe the white silent one might be?'},\n{'question': 'Please highlight in the paragraph: Which character does the narrator believe holds the key to understanding the entire story?'}\n]\n```"
   },
   {
      "filename": "The Dumb Man",
      "questions": "[{\"question\": \"Please highlight in the paragraph: How many men are initially in the room at the beginning of the story?\", \"answer\": \"The story concerns three men in a house in a street.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What physical characteristic distinguishes the second man?\", \"answer\": \"There is a second man who has a long white beard.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: How does the narrator describe the movement of the man with wicked eyes?\", \"answer\": \"A third man there is who has wicked eyes and who moves nervously about the room rubbing his hands together.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What is the woman doing upstairs?\", \"answer\": \"Upstairs in the house there is a woman standing with her back to a wall, in half darkness by a window.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What is the fourth man's defining characteristic?\", \"answer\": \"I remember that a fourth man came to the house, a white silent man.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: How does the old grey man react to the arrival of the fourth man?\", \"answer\": \"The old grey man was infected by his nervousness - he kept pulling at his beard.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What does the narrator say the woman upstairs craved?\", \"answer\": \"The woman upstairs craved love.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What eventually happens to the old grey man?\", \"answer\": \"He never awoke again.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What does the narrator speculate the white silent one might represent?\", \"answer\": \"The white silent one may have been Death.\", \"category\": \"inferential\"}, {\"question\": \"Please highlight in the paragraph: According to the narrator, understanding which character would unlock the story's meaning?\", \"answer\": \"If I could understand him I could understand everything.\", \"category\": \"inferential\"}]",
      "category": "HL"
   },
   {
      "filename": "The Dumb Man",
      "questions": "[{\"question\": \"Please highlight in the paragraph: What does the downstairs neighbor do while the woman waits?\", \"answer\": \"The wicked one whined and ran back and forth like a little lost hungry dog.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: How many men are in the story in total?\", \"answer\": \"I remember that a fourth man came to the house, a white silent man.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: The narrator keeps thinking about one of the men. Which one and why is he memorable?\", \"answer\": \"I keep thinking about the dandified man who laughed all through my story.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What happened to the old man with the beard after the fourth man came?\", \"answer\": \"He never awoke again.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph:  What does the woman crave?\", \"answer\": \"The woman upstairs craved love.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What happens to the man with the beard after the fourth man arrives?\", \"answer\": \"The grey one tried to follow him about but presently grew tired and lay down on the floor to sleep.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: How does the narrator describe the sound of the fourth man's arrival?\", \"answer\": \"Everything was as silent as the sea at night.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: According to the narrator, who might the white silent man be?\", \"answer\": \"The white silent one may have been Death.\", \"category\": \"inferential\"}, {\"question\": \"Please highlight in the paragraph:  What does the narrator wish he could do with his story?\", \"answer\": \"If I could say the words I would sing the story.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: According to the narrator, who might the waiting woman be?\", \"answer\": \"The waiting eager woman may have been Life.\", \"category\": \"inferential\"}]",
      "category": "HL"
   },
   {
      "filename": "The Dumb Man",
      "questions": "[{\"question\": \"Please highlight in the paragraph: How does the narrator describe the house's atmosphere when the fourth man arrives?\", \"answer\": \"Everything was as silent as the sea at night.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What physical action does the old grey man repeat due to his nervousness?\", \"answer\": \"he kept pulling at his beard.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What does the woman upstairs crave?\", \"answer\": \"The woman upstairs craved love.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: How are the white silent man's eyes described?\", \"answer\": \"His eyes were as impersonal as stars.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What happened to the old grey man after he grew tired?\", \"answer\": \"He never awoke again.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What did the dandified fellow do while lying on the floor?\", \"answer\": \"He laughed and played with his tiny black moustache.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: Who does the narrator speculate the white silent man might be?\", \"answer\": \"The white silent one may have been Death.\", \"category\": \"inferential\"}, {\"question\": \"Please highlight in the paragraph: Who does the narrator speculate the waiting woman might be?\", \"answer\": \"The waiting eager woman may have been Life.\", \"category\": \"inferential\"}, {\"question\": \"Please highlight in the paragraph: Which character puzzles the narrator the most, besides the dandified man?\", \"answer\": \"Both the old grey bearded man and the wicked one puzzle me.\", \"category\": \"literal\"}, {\"question\": \"Please highlight in the paragraph: What does the narrator believe would happen if he could understand the dandified man?\", \"answer\": \"If I could understand him I could understand everything.\", \"category\": \"inferential\"}]",
      "category": "HL"
   }
]