[
   {
      "filename": "The Solar System",
      "questions": "[{'question': 'What is Pluto now classified as?'}, {'question': 'What celestial bodies occupy the region between Mars and Jupiter?'}, {'question': 'What two celestial events are caused by the planets rotations?'}, {'question': 'Besides planets and the sun, name three other things found in our solar system.'}, {'question': 'What causes the changes in seasons on Earth?'}, {'question': 'Which four planets make up the inner solar system?'}, {'question': 'Why is the Milky Way Galaxy named as such?'}, {'question': 'Approximately how many solar systems are estimated to exist in our universe?'}, {'question': 'What is at the center of our solar system?'}, {'question': 'What is unique about Earth according to scientists and astronomers?'}] \n"
   },
   {
      "filename": "The Dumb Man",
      "questions": "[{'question': 'What is the main emotion the narrator feels about his inability to tell the story?'}, {'question': 'How many men are in the house in total?'}, {'question': 'Describe the demeanor of the young man.'}, {'question': 'What physical action does the man with wicked eyes repeatedly do?'}, {'question': 'What does the woman in the story crave?'}, {'question': 'How is the fourth man described?'}, {'question': 'What happens to the old grey man?'}, {'question': 'What does the narrator believe understanding about the dandified man would allow him to do?'}, {'question': 'What two abstract concepts does the narrator speculate the white silent man and the woman might represent?'}, {'question': 'What literary device does the repeated phrase \"I have no words\" emphasize? '}]"
   },
   {
      "filename": "The Solar System",
      "questions": "[{'question': 'What is at the center of our solar system?'}, {'question': 'What celestial body separates the inner planets from the outer planets?'}, {'question': 'What causes day and night on Earth?'}, {'question': 'What causes the change of seasons on Earth?'}, {'question': 'Why is Pluto no longer considered a planet?'}, {'question': 'Besides planets and the Sun, name two other objects found in our solar system.'}, {'question': 'Approximately how many solar systems are estimated to be in our universe?'}, {'question': 'What galaxy is our solar system located in?'}, {'question': 'Why is our galaxy called the Milky Way?'}, {'question': 'According to current scientific understanding, what is unique about Earth?  '}] \n"
   },
   {
      "filename": "The Solar System",
      "questions": "[{'question': 'What is Pluto considered to be?'}, {'question': 'What celestial objects are found between Mars and Jupiter?'}, {'question': 'Which planet is the largest in our solar system?'}, {'question': 'What causes the change of seasons on Earth?'}, {'question': 'What is the name of our galaxy?'}, {'question': 'Why is our galaxy called the Milky Way?'}, {'question': 'Which planets make up the inner solar system?'}, {'question': 'What causes day and night on Earth?'}, {'question': 'Approximately how many solar systems are estimated to be in our universe?'}, {'question': 'Besides the eight planets and the sun, what other objects are found in our solar system?'}]\n"
   },
   {
      "filename": "The Solar System",
      "questions": "[{'question': 'What is Pluto considered to be?'}, {'question': 'What celestial bodies occupy the region between Mars and Jupiter?'}, {'question': 'Which celestial body is at the center of our solar system?'}, {'question': 'What causes the cycle of day and night on Earth?'}, {'question': 'What astronomical phenomenon is responsible for the changing seasons on Earth?'}, {'question': 'What is the name of the galaxy that contains our solar system?'}, {'question': 'Why is our galaxy called the Milky Way?'}, {'question': 'Approximately how many solar systems are estimated to exist in our universe?'}, {'question': 'Besides planets and their moons, name three other components found in our solar system.'}, {'question': 'What makes Earth unique among the planets in our solar system, according to current scientific understanding?'}] \n"
   },
   {
      "filename": "The Solar System",
      "questions": "[{'question': 'What is Pluto classified as?'}, {'question': 'What celestial bodies occupy the region between Mars and Jupiter?'}, {'question': 'Which planets constitute the inner solar system?'}, {'question': 'What is responsible for the change of seasons on Earth?'}, {'question': 'What causes day and night on Earth?'}, {'question': 'What is the name of our galaxy?'}, {'question': 'Why is our galaxy called the Milky Way?'}, {'question': 'Approximately how many solar systems are estimated to exist in our universe?'}, {'question': 'Besides planets and their moons, what other objects can be found in our solar system?'}, {'question': 'Which planet is currently believed to be the only one with life?  '}] \n"
   },
   {
      "filename": "The Dumb Man",
      "questions": "```json\n[{'question': 'How many men are in the room at the beginning of the story?'}, {'question': 'What distinguishes the youngest man from the others?'}, {'question': 'What action does the man with \"wicked eyes\" repeatedly perform?'}, {'question': 'What is the woman upstairs doing?'}, {'question': 'How is the fourth man described?'}, {'question': 'What effect does the fourth man have on the \"wicked one\"?'}, {'question': 'What happens to the old grey man after the fourth man arrives?'}, {'question': 'How does the narrator describe the house while the story unfolds?'}, {'question': 'Who does the narrator speculate the white silent man might be?'}, {'question': 'What does the narrator desperately want to be able to do?'}]\n```"
   },
   {
      "filename": "The Dumb Man",
      "questions": "[{'question': 'What is the narrator struggling to do throughout the story?'}, {'question': 'How many men are present in the house in total?'}, {'question': 'Describe the demeanor of the young man.'}, {'question': 'What is the old man consumed by?'}, {'question': 'How is the fourth man described?'}, {'question': 'What does the woman crave?'}, {'question': 'How does the wicked man react to the fourth man’s arrival?'}, {'question': 'What happens to the old man after the fourth man arrives?'}, {'question': 'Who does the narrator suspect the white silent man might be?'}, {'question': 'What does the narrator believe understanding about the dandified man would allow him to do?'}]"
   },
   {
      "filename": "The Dumb Man",
      "questions": "[{'question': 'What is the narrator struggling to articulate?'}, {'question': 'How many men are in the room at the beginning of the story?'}, {'question': 'Describe the three men in the room.'}, {'question': 'What is the woman upstairs doing?'}, {'question': 'How does the arrival of the fourth man affect the others?'}, {'question': 'What is the narrator’s interpretation of the white silent man and the woman?'}, {'question': 'What happens to the old grey man?'}, {'question': 'Which character does the narrator most want to understand?'}, {'question': 'What does the narrator believe would happen if he understood the dandified man?'}, {'question': 'What is the primary source of the narrator’s frustration?'}]"
   },
   {
      "filename": "The Dumb Man",
      "questions": "[{\"question\": \"How many men are in the room at the start of the story?\", \"answer\": \"Three men are in the room at the start.\", \"category\": \"literal\"}, {\"question\": \"Describe the first man.\", \"answer\": \"The first man is young, stylishly dressed (dandified), and laughs frequently.\", \"category\": \"literal\"}, {\"question\": \"What consumes the second man?\", \"answer\": \"The second man is consumed by doubt.\", \"category\": \"literal\"}, {\"question\": \"What does the third man do?\", \"answer\": \"The third man has shifty eyes and nervously paces while wringing his hands.\", \"category\": \"literal\"}, {\"question\": \"Where is the woman in the story?\", \"answer\": \"The woman is upstairs, standing by a window with her back against the wall.\", \"category\": \"literal\"}, {\"question\": \"How does the narrator describe the arrival of the fourth man?\", \"answer\": \"The narrator emphasizes the silence of the fourth man's arrival, comparing it to the stillness of the sea at night.\", \"category\": \"literal\"}, {\"question\": \"What is the reaction of the man with wicked eyes to the fourth man's arrival?\", \"answer\": \"He becomes agitated, pacing like a trapped animal.\", \"category\": \"literal\"}, {\"question\": \"What does the woman crave?\", \"answer\": \"The woman craves love and the creative power of love.\", \"category\": \"literal\"}, {\"question\": \"Who might the white silent man symbolize?\", \"answer\": \"The white silent man might symbolize Death.\", \"category\": \"inferential\"}, {\"question\": \"What does the narrator believe understanding the dandified man would allow him to do?\", \"answer\": \"The narrator believes that understanding the laughing man would unlock the meaning of the entire story and enable him to finally tell it.\", \"category\": \"inferential\"}]",
      "category": "SA"
   },
   {
      "filename": "The Dumb Man",
      "questions": "[{\"question\": \"How many men are in the room at the beginning of the story?\", \"answer\": \"Three men are in the room at the start.\", \"category\": \"literal\"}, {\"question\": \"Describe the first man mentioned in the story.\", \"answer\": \"He is described as young and dandified, always laughing.\", \"category\": \"literal\"}, {\"question\": \"What is the old man with the white beard consumed by?\", \"answer\": \"He is consumed by doubt.\", \"category\": \"literal\"}, {\"question\": \"What does the third man do while waiting?\", \"answer\": \"He nervously rubs his hands together and moves around the room.\", \"category\": \"literal\"}, {\"question\": \"Who is waiting upstairs?\", \"answer\": \"A woman standing by a window is waiting upstairs.\", \"category\": \"literal\"}, {\"question\": \"How does the narrator describe the house's atmosphere upon the fourth man's arrival?\", \"answer\": \"The narrator describes the house as silent as the sea at night.\", \"category\": \"literal\"}, {\"question\": \"What did the woman crave?\", \"answer\": \"The woman craved love and the ability to create in love.\", \"category\": \"literal\"}, {\"question\": \"What happens to the old man after the fourth man goes upstairs?\", \"answer\": \"He tries to follow the wicked man, gets tired, lies down, and never wakes up.\", \"category\": \"literal\"}, {\"question\": \"What does the narrator think about most often in relation to the story?\", \"answer\": \"The narrator thinks most about the dandified man who laughed throughout the story.\", \"category\": \"literal\"}, {\"question\": \"Why is the narrator frustrated at the end of the story?\", \"answer\": \"The narrator feels they have a powerful story but lacks the words to tell it.\", \"category\": \"inferential\"}]",
      "category": "SA"
   },
   {
      "filename": "The Dumb Man",
      "questions": "[{\"question\": \"How many men are in the room at the beginning of the story?\", \"answer\": \"There are three men in the room at the beginning of the story.\", \"category\": \"literal\"}, {\"question\": \"What does the dandified man do throughout the story?\", \"answer\": \"The dandified man laughs throughout the story.\", \"category\": \"literal\"}, {\"question\": \"What does the woman crave?\", \"answer\": \"The woman craves love.\", \"category\": \"literal\"}, {\"question\": \"What happens to the old grey man?\", \"answer\": \"The old grey man lies down to sleep and never wakes up.\", \"category\": \"literal\"}, {\"question\": \"Who might the white silent man represent?\", \"answer\": \"The white silent man may represent Death.\", \"category\": \"inferential\"}, {\"question\": \"Who might the waiting woman represent?\", \"answer\": \"The waiting woman may represent Life.\", \"category\": \"inferential\"}, {\"question\": \"Why is the narrator frustrated?\", \"answer\": \"The narrator is frustrated because he cannot find the words to tell his story.\", \"category\": \"inferential\"}, {\"question\": \"What does the narrator wish he could do with his story?\", \"answer\": \"The narrator wishes he could run through the streets and sing his story.\", \"category\": \"literal\"}, {\"question\": \"What does the silence of the house emphasize?\", \"answer\": \"The silence of the house emphasizes the tension and anticipation surrounding the events.\", \"category\": \"inferential\"}, {\"question\": \"What does the narrator believe understanding the dandified man would allow him to do?\", \"answer\": \"The narrator believes that understanding the dandified man would allow him to understand everything and tell his story.\", \"category\": \"inferential\"}]",
      "category": "SA"
   },
   {
      "filename": "Ned Kelly",
      "questions": "[{\"question\": \"Where and when was Ned Kelly born?\", \"answer\": \"Ned Kelly was born in 1850 near Melbourne, Victoria.\", \"category\": \"literal\"}, {\"question\": \"What type of crimes was the Kelly Gang involved in?\", \"answer\": \"The Kelly Gang was involved in crimes such as horse theft and bank robberies.\", \"category\": \"literal\"}, {\"question\": \"Why did Ned Kelly and his brothers have conflicts with the police?\", \"answer\": \"They believed the police were corrupt and biased against the working class.\", \"category\": \"literal\"}, {\"question\": \"What happened at the Glenrowan Inn in 1880?\", \"answer\": \"The Kelly Gang, in a stand against the police, barricaded themselves inside the inn leading to a shootout and deaths of police officers and civilians.\", \"category\": \"literal\"}, {\"question\": \"What is Ned Kelly most infamous for?\", \"answer\": \"Ned Kelly is most infamous for the Kelly Gang's siege of the Glenrowan Inn.\", \"category\": \"literal\"}, {\"question\": \"How is Ned Kelly's story kept alive today?\", \"answer\": \"His story continues to be told through books, films, and songs.\", \"category\": \"literal\"}, {\"question\": \"What was the general economic situation of the working class during Ned Kelly's time?\", \"answer\": \"The text states that Kelly grew up in a poverty-stricken family, implying that the working class during his time experienced hardship.\", \"category\": \"inferential\"}, {\"question\": \"Why did some Australians view Ned Kelly as a hero?\", \"answer\": \"They admired his defiance of authority and saw him as a champion for the oppressed working class.\", \"category\": \"inferential\"}, {\"question\": \"How did the siege at Glenrowan Inn affect Ned Kelly's public image?\", \"answer\": \"This event likely solidified his image as both an outlaw and a folk hero, deepening the divide in public opinion about him.\", \"category\": \"inferential\"}, {\"question\": \"Why do you think Ned Kelly's story continues to resonate with people today?\", \"answer\": \"His story of resistance against perceived injustice and his fight for the disadvantaged likely still resonate with people facing similar struggles.\", \"category\": \"inferential\"}]",
      "category": "SA"
   },
   {
      "filename": "The Dumb Man",
      "questions": "[{\"question\": \"How many men are in the room at the beginning of the story?\", \"answer\": \"Three.\", \"category\": \"literal\"}, {\"question\": \"What physical characteristic stands out about the second man?\", \"answer\": \"He has a long white beard.\", \"category\": \"literal\"}, {\"question\": \"What does the woman upstairs crave?\", \"answer\": \"Love.\", \"category\": \"literal\"}, {\"question\": \"What animals are used to describe the 'wicked one'?\", \"answer\": \"A boiling liquid and a caged animal.\", \"category\": \"literal\"}, {\"question\": \"What happens to the old grey man?\", \"answer\": \"He lies down to sleep and never wakes up.\", \"category\": \"literal\"}, {\"question\": \"What is the narrator's primary frustration?\", \"answer\": \"He cannot find the words to tell his story.\", \"category\": \"literal\"}, {\"question\": \"What does the narrator believe understanding the dandified man would allow him to do?\", \"answer\": \"Understand everything and be able to tell his story.\", \"category\": \"literal\"}, {\"question\": \"Who does the narrator speculate the white silent man might be?\", \"answer\": \"Death.\", \"category\": \"inferential\"}, {\"question\": \"What is the significance of the narrator's focus on the dandified man's laughter?\", \"answer\": \"It likely represents an element of the human condition or the story's theme that the narrator is struggling to grasp.\", \"category\": \"inferential\"}, {\"question\": \"What might the woman's desire for love symbolize within the context of the story?\", \"answer\": \"It could symbolize a longing for connection, purpose, or creation in a world that can feel indifferent or even cruel.\", \"category\": \"inferential\"}]",
      "category": "SA"
   },
   {
      "filename": "Ned Kelly",
      "questions": "[{\"question\": \"When was Ned Kelly born?\", \"answer\": \"1850\", \"category\": \"literal\"}, {\"question\": \"Where in Australia was Ned Kelly born?\", \"answer\": \"Near Melbourne, Victoria\", \"category\": \"literal\"}, {\"question\": \"What type of crimes did the Kelly Gang commit?\", \"answer\": \"Horse theft and bank robberies\", \"category\": \"literal\"}, {\"question\": \"Why did the Kelly Gang barricade themselves in the Glenrowan Inn?\", \"answer\": \"To make a desperate stand against the police\", \"category\": \"literal\"}, {\"question\": \"What year did the siege of Glenrowan Inn take place?\", \"answer\": \"1880\", \"category\": \"literal\"}, {\"question\": \"What was the outcome of the shootout at Glenrowan Inn?\", \"answer\": \"Several police officers and civilians were killed\", \"category\": \"literal\"}, {\"question\": \"Why did Ned Kelly and his gang have conflict with the police?\", \"answer\": \"They believed the police were corrupt and biased against the working class\", \"category\": \"literal\"}, {\"question\": \"Why did some Australians view Ned Kelly as a hero?\", \"answer\": \"He defied authority and was seen as a champion of the oppressed working class\", \"category\": \"literal\"}, {\"question\": \"What aspects of Kelly's upbringing might have contributed to his distrust of authority?\", \"answer\": \"Growing up in poverty and experiencing hardship likely fueled Kelly's distrust of those in power.\", \"category\": \"inferential\"}, {\"question\": \"How has Ned Kelly's story remained relevant in popular culture?\", \"answer\": \"Through books, films, and songs, his story continues to be told and interpreted.\", \"category\": \"inferential\"}]",
      "category": "SA"
   }
]